In [40]:
!pip install pymysql

Requirement already satisfied: pymysql in /Users/genivabraaf/opt/anaconda3/lib/python3.8/site-packages (1.0.2)

LAB 9 SQL

In [41]:
import pymysql

In [42]:
from sqlalchemy import create_engine

In [43]:
import getpass

In [44]:
import pandas as pd

In [45]:
import numpy as np

Create a Python connection with SQL database and retrieve the results of the last two queries (also mentioned below) as dataframes

In [46]:
password = getpass.getpass()
connection = 'mysql+pymysql://root:' + password + '@localhost/sakila'
engine = create_engine(connection)

········

Check the number of rentals for each customer for May

In [47]:
query = ''' 
select customer_id, count(*) 
from rental_may
group by customer_id
order by count(*) desc
''' 
data = pd.read_sql_query(query, engine)
data

     customer_id  count(*)
0            197         8
1             19         6
2            371         6
3            245         6
4            274         6
..           ...       ...
478          262         1
479           11         1
480           12         1
481          123         1
482          513         1

[483 rows x 2 columns]

Check the number of rentals for each customer for June

In [48]:
query = ''' 
select customer_id, count(*) 
from rental_june
group by customer_id
order by count(*) desc;
''' 
data2 = pd.read_sql_query(query, engine)
data2

     customer_id  count(*)
0             31        11
1            454        10
2            329         9
3            295         9
4            561         9
..           ...       ...
585          425         1
586          412         1
587          335         1
588           22         1
589          126         1

[590 rows x 2 columns]

In [66]:
query = ''' 
select count(rental_id) 
from rental_may
where customer_id = 130
''' 
rental_may_C130 = pd.read_sql_query(query, engine)
value_may_C130 = rental_may_C130.values
print(value_may_C130)

[[2]]

In [67]:
query = ''' 
select count(rental_id) 
from rental_june
where customer_id = 130
''' 
rental_june_C130 = pd.read_sql_query(query, engine)
value_june_C130 = rental_june_C130.values
print(value_june_C130)

[[6]]

Write a function that checks if customer borrowed more or less films in the month of June as compared to May.

In [73]:
def What_is_bigger():
    if value_may_C130 > value_june_C130:
        print('Customer 130 rented more movies in may than in june')
    if value_june_C130> value_may_C130 :
        print('Customer 130 rented more movies in june than in may')
    else:
        print('Customer 130 rented the same amount of movies in june than in may')
What_is_bigger()

Customer 130 rented more movies in june than in may